# 2ndDay

## ChatGPT

> GPT
>> Genetative / Pre-trained / Transformer
>> - 생성 모델 / 사전 훈련 / 트랜스포머 AI 모델
>> - GPT 모델을 기반으로 한 대화형 AI
----------------------------------------------
> Generative AI 
>> - 기존 패턴을 기반으로 오디오, 비디오, 이미지, 텍스트, 코드, 시뮬레이션 등의 새로운 콘텐츠를 생성하는 인공지능 모델
----------------------------------------------
> Pre-trained
>> - 거대 언어 모델
>> - 추가 학습 데이터
>> - 추가 강화 학습
----------------------------------------------
> Transformer
>> Neural Network Architecture
>> - 문장 속의 단어 간 관계 추적 후 맥락과 의미 학습
>> - 인간처럼 일관되고 연관성이 높은 언어를 구사해 대화형 작업에 강점
>> - Self-Attention 메커니즘을 통한 입력 데이터 간의 관계와 중요도 계산
>> - 병렬 처리 가능해 RNN과 달리 순차 천리가 필요 없어 속도가 빠름
>> - 스케일링이 가능해 대규모 데이터 및 파라미터로 확장 가능
>> - GPT 모델은 특히 디코더 부분만을 사용
--------------------------------------------------
> Attention 메커니즘
>> - AI가 데이터의 맥락과 중요도를 이해하도록 돕는 필수 기술
>> - 입력 데이터의 각 요소가 출력에 얼마나 중요한지 중요도(Weight)를 계산하는 기법
>> - "중요한 것에 집중한다(attention)"는 아이디어를 바탕으로 설계
>> - Self-Attention과 Multi-Head Attention으로 나뉨
--------------------------------------------------
> Interface
>> - 서로 다른 두 개의 시스템이 정보를 교환할 때, 그 사이에 존재하는 접점
>> - 사용자가 기기를 쉽게 동작 시키거나 기계와 기계가 통신할 때 필요한 약속된 방식
>> - Ex) 키보드 마우스 모니터 TV리모컨 자동차 운전대 페달 스마트폰 터치 스크린
--------------------------------------------------
> UI
>> User Interface
>> - 사용자가 소프트웨어에 접근하는 그래픽, 화면적 요소
>> - Ex) ATM의 언어 선택 화면 브라우저 뒤로가기 버튼 스마트폰 앱 아이콘
---------------------------------------------------
> Client/Server
>> Client : 서비스를 요청
>> Server : 요청을 받아서 처리하고 결과를 응답
---------------------------------------------------
> API
>> Application Programming Interface
>> - 두 소프트웨어 혹은 시스템이 서로 통신할 수 있게 하는 메커니즘
>> - Application : 특정 기능을 수행하는 모든 S/W
>> - API Key : API에게 요청을 보내는 Applicaiton을 구별하기 위한 고유 식별 문자
--------------------------------------------------
> API Key
>> 장점과 단점
>> - 보안 강화, 데이터 관리에 유용함
>> - 공개된 곳에 노출하지 말 것 -> 유출될 경우 무단 사용 위험
---------------------------------------------------
> Token
>> - GPT와 같은 인공지능 모델에서 텍스트 데이터를 처리하고 이해하는 기본 단위
>> - 토큰은 문장에서 단어로 생각할 수 있음
>> - 각 토큰 별 고유 숫자가 매겨져 있음
>> - 최대 입력 토큰 제한 = 각 LLM 모델마다 최대로 입력할 수 있는 토큰 수의 제한
>> - [google] https://platform.openai.com/tokenizer 토큰 수 확인 사이
---------------------------------------------------
> OpenAI API 주요 파라미터
>> 필수 파라미터
>> - Model : GPT 모델 이름
>> - messages : 대화 메세지 기록
>> - 응답 다양성 제어
--------------------------------------------------
> Temperature
>> Token 예측의 다양성 조정 (0 ~ 2)
>> - 응답의 창의성과 다양성 조정
>> - 확률 분포를 날카롭거나 평탄하게 만드는 역할
>> - 높은 확률은 더 높고 낮은 확률은 더 낮게 조정
>> - 모든 후보 단어의 확률을 조정하여 다양한 응답
------------------------------------------------
> Top_p
>> 선택할 Token의 확률 범위를 제한 (0 ~ 1)
>> - 누적 확률 기반으로 응답의 범위 제한
>> - 누적 확률 기준으로 단어 후보의 수 제한
>> - 응답의 신뢰성과 예측 가능성을 조정
----------------------------------------------
> Temperature, Top_p
>> - 높은 Temperature + 낮은 Top_p = 창의적이고 독창적인 응답
>> - 낮은 Temperature + 높은 Top_p = 응답이 안정적이고 예측 가
